{
  "site": {
    "title": "Adv. Noor Z. Khattak | Best Wakeel & Senior Legal Counsel in Karachi",
    "description": "Adv. Noor Z. Khattak is a trusted wakeel (senior legal counsel) in Karachi with expertise in corporate law, banking regulations, and commercial litigation. Offering top-tier legal services in Sindh High Court.",
    "url": "https://noorkhattak.vercel.app",
    "author": "Adv. Noor Z. Khattak",
    "keywords": "lawyer, advocate, wakeel, Karachi, Sindh, Pakistan, corporate law, banking regulations, High Court, legal services, commercial litigation, legal counsel, best lawyer in Karachi, top wakeel in Karachi, best advocate in Karachi",
    "ogImage": "https://noorkhattak.vercel.app/og-image.jpg"
  },
  "pages": {
    "home": {
      "title": "Home",
      "description": "Adv. Noor Z. Khattak is Karachi's trusted wakeel with expertise in corporate law, banking regulations, and commercial litigation. Top-rated legal services in Sindh High Court.",
      "keywords": "lawyer, advocate, wakeel, Karachi, Sindh, Pakistan, corporate law, banking regulations, High Court, legal services, Karachi best lawyer, top wakeel in Karachi, best legal services in Karachi"
    },
    "about": {
      "title": "About Me",
      "description": "Learn about Adv. Noor Z. Khattak, one of Karachi's most respected wakeels and senior legal counsels. Discover my background, qualifications, and commitment to providing exceptional legal services.",
      "keywords": "lawyer biography, legal experience, Karachi advocate, legal qualifications, legal philosophy, wakeel in Karachi, best lawyer in Sindh, experienced wakeel"
    },
    "expertise": {
      "title": "My Legal Expertise",
      "description": "Discover my areas of legal expertise as a top wakeel in Karachi, including corporate law, banking regulations, commercial litigation, and family law matters.",
      "keywords": "corporate law, banking regulations, commercial litigation, legal expertise, Pakistan law specialization, top corporate lawyer in Karachi, best wakeel for corporate cases, experienced banking law advocate"
    },
    "experience": {
      "title": "My Professional Experience",
      "description": "Explore my extensive legal experience as one of Karachi's premier wakeels, including major cases and successful outcomes for clients throughout my career.",
      "keywords": "legal career, case history, lawyer experience, Karachi legal practice, court experience, experienced wakeel in Karachi, best lawyer for High Court cases, successful advocate in Sindh"
    },
    "contact": {
      "title": "Contact Me",
      "description": "Contact Adv. Noor Z. Khattak, a top-rated wakeel in Karachi. Get in touch for expert legal consultation and services tailored to your needs.",
      "keywords": "legal consultation, lawyer contact, Karachi legal services, attorney appointment, legal advice, hire best wakeel in Karachi, top advocate consultation, contact Karachi lawyer"
    },
    "notFound": {
      "title": "Page Not Found",
      "description": "The page you're looking for cannot be found. Please navigate back to the homepage of Adv. Noor Z. Khattak, top wakeel in Karachi.",
      "keywords": "page not found, 404, error page, Karachi lawyer, wakeel in Karachi"
    }
  },
  "social": {
    "twitter": "@noorkhattak",
    "facebook": "noorkhattak",
    "linkedin": "in/noorkhattak"
  },
  "structuredData": {
    "attorney": {
      "@context": "https://schema.org",
      "@type": "Attorney",
      "name": "Adv. Noor Z. Khattak",
      "description": "Senior Legal Counsel specializing in corporate law, banking regulations, and commercial litigation in Karachi, Pakistan.",
      "url": "https://noorkhattak.vercel.app",
      "image": "https://noorkhattak.vercel.app/Noor_Khattak.jpeg",
      "alternateName": ["Wakeel in Karachi", "Top Advocate in Sindh", "Best Lawyer in Karachi"],
      "address": {
        "@type": "PostalAddress",
        "addressLocality": "Karachi",
        "addressRegion": "Sindh",
        "addressCountry": "Pakistan"
      },
      "telephone": "+92 333 2276821",
      "email": "nzkhattak20@gmail.com"
    }
  }
} 